tests/data/IN_testData.json

{
    "login": {
        "loginCompanyId": "IN2BFE1",
        "loginUserId": "IN2BFE1S01",
        "verifyUserId": "IN2BFE1S02"
    },
    "status": {
        "Approved": "Approved",
        "PendingApproval": "Pending Approval",
        "PartialApproved": "Partial Approved",
        "PendingRelease": "Pending Release",
        "PendingVerification": "Pending Verification",
        "PartialCompleted": "Partial Completed",
        "Received": "Received",
        "Completed": "Completed",
        "Saved": "Saved",
        "Submitted": "Submitted",
        "BankRejected": "Bank Rejected",
        "Rejected": "Rejected",
        "Failed": "Failed",
        "Cancelled": "Cancelled",
        "PendingSupportingDocument":"Pending Supporting Document"
    },
    "paymentType": {
        "IN_NEFT": "IN - NEFT Payment",
        "IN_RTGS": "IN - RTGS Payment",
        "IM_IMPS": "IN - IMPS Payment"
    },
    "NEFTPayment": {
        "SIT": {
            "loginCompanyId": "SPI303",
            "loginUserId": "SPI303V011",
            "verifyUserId": "SPI303V09",
            "fromAccount": "0017001765",
            "payeeBankID": "BACB0000006"
        },
        "Country": "INDIA",
        "paymentCurrency": "INR",
        "amountA1": "10",
        "amountA2": "1,500",
        "amountV": "3,500",
        "editAmount": "100",
        "fxAmount0": "10",
        "existingPayee": "AutoNEFTExistingPayee",
        "existingPayeeIx": "AutoNEFTExistingPayee",
        "newPayeeName": "NEFTNewPayeeName",
        "newPayeeAdd1": "newPayeeAdd1",
        "newPayeeAdd2": "newPayeeAdd2",
        "newPayeeAdd3": "newPayeeAdd3",
        "newPayeeAcctNumber": "123456000001",
        "category": "Beneficiary2",
        "paymentDetail": "PaymentDetails",
        "emailIdO": "Email0@dbs.com",
        "emailId1": "Email1@dbs.com",
        "emailId2": "Email2@dbs.com",
        "emailId3": "Email3@dbs.com",
        "emailId4": "Email4@dbs.com",
        "message": "message",
        "payeeReference": "payeeReference",
        "faxCountryCode0": "65",
        "faxAreaCode0": "000",
        "faxNo0": "76786778",
        "transactionNote": "transactionNote",
        "messageToOrderingBank": "messageToOrderingBank",
        "WithoutChllengeText": "Enter this Challenge to your Digital Token or Security Device",
        "mChllengeText": "you are receiving the Challenge by SMS because you are trying to approve a transaction that you have created",
        "existingTemplateName": "NEFTtemplateName001",
        "paymentType": "India NEFT Payment",
        "bankName": "BACB",
        "bankAdd1": " . ",
        "bankAdd2": "MANICKPUR",
        "bankCity": "MUMBAI",
        "bankCountry": "IND",
        "bankCode": "BACB",
        "bankBrchCode": "BACB00"
    },
    "RTGSPayment": {
        "SIT": {
            "loginCompanyId": "SPI303",
            "loginUserId": "SPI303V01",
            "verifyUserId": "SPI303V02",
            "fromAccount": "0017001765"
        },
        "Country": "INDIA",
        "amountA1": "200,003",
        "amountA2": "300,003",
        "amountV": "400,003",
        "editAmount": "200,004",
        "existingPayee": "RTGSExistingPayee",
        "newPayeeName": "RTGSNewPayeeName",
        "newPayeeAdd1": "newPayeeAdd1",
        "newPayeeAdd2": "newPayeeAdd2",
        "newPayeeAdd3": "newPayeeAdd3",
        "payeeBankID": "BKID0003817",
        "payeeBankCode": "013",
        "payeeBranchCode": "025782",
        "newPayeeAcctNumber": "123456000001",
        "category": "Beneficiary2",
        "paymentDetail": "PaymentDetails",
        "emailIdO": "Email0@dbs.com",
        "emailId1": "Email1@dbs.com",
        "emailId2": "Email2@dbs.com",
        "emailId3": "Email3@dbs.com",
        "emailId4": "Email4@dbs.com",
        "message": "message",
        "paymentType": "India RTGS Payment",
        "payeeBankName": "BANK OF INDIA(BOI)",
        "bankAdd1": "KUTCH",
        "bankAdd2": "BHUJ",
        "payeeBankCity": ".",
        "payeeBankCountry": "IND",
        "faxCountryCode0": "65",
        "faxAreaCode0": "000",
        "faxNo0": "76786778",
        "transactionNote": "transactionNote",
        "messageToOrderingBank": "messageToOrderingBank",
        "existingTemplateName": "RTGStemplateName001",
        "maxAmount": "999,999,999.99",
        "greaterMaxAmount": "1,000,000,000",
        "minAmount": "200,000",
        "lessMinAmount": "199,999",
        "errorMessage": "One or more of the fields below have not been properly filled up. Please amend and submit again."
    },
    "IMPSPayment": {
        "SIT": {
            "loginCompanyId": "SPI303",
            "loginUserId": "SPI303V05",
            "verifyUserId": "SPI303V06",
            "fromAccount": "0017001765",
            "payeeBankID": "MAHB0001447",
            "fileName": ""
        },
        "amountA1": "10",
        "amountA2": "1,500",
        "amountV": "3,500",
        "editAmount": "100",
        "existingPayee": "IMPSExistingPayee",
        "newPayeeName": "IMPSNewPayeeName",
        "newPayeeAdd1": "newPayeeAdd1",
        "newPayeeAdd2": "newPayeeAdd2",
        "newPayeeAdd3": "newPayeeAdd3",
        "newPayeeAcctNumber": "123456000001",
        "mmid": "1234567",
        "mobileNumber": "9999888888",
        "paymentDetail": "PaymentDetails",
        "emailIdO": "Email0@dbs.com",
        "emailId1": "Email1@dbs.com",
        "emailId2": "Email2@dbs.com",
        "emailId3": "Email3@dbs.com",
        "emailId4": "Email4@dbs.com",
        "message": "message",
        "transactionNote": "transactionNote",
        "messageToOrderingBank": "messageToOrderingBank",
        "existingTemplateName": "IMPSTemplateForAutoTest",
        "downloadFileType": "IMPS Payment - UFF",
        "fromDate": "08 Apr 2022",
        "approvalOptionByTxn": "By Transaction",
        "labelNoInformationDisplay": "No information to display",
        "paymentType": "India IMPS Payment"
    },
    "BulkCollection": {
        "SIT": {
            "loginCompanyId": "IN2BFE1",
            "loginUserId": "IN2BFE1A02",
            "fromAccount": "466588832"
        },
        "amount": "10",
        "editAmount": "100",
        "UCICCode": "123456789009876545",
        "newPayeeName": "Bulk Collection NewPayer Name 11111",
        "payeeBankAccountNumber": "12345600000",
        "DDAreference": "DDAReferenceDDARefer",
        "referenceForPayee": "referenceForPayerreferenceForP",
        "payeeBankID": "26490200",
        "emailIdO": "Email0@dbs.com",
        "emailId1": "Email1@dbs.com",
        "emailId2": "Email2@dbs.com",
        "emailId3": "Email3@dbs.com",
        "emailId4": "Email4@dbs.com",
        "message": "message",
        "messageEdit": "messageEdit",
        "paymentType": "India Bulk Collection",
        "payeeBankName": "DEPOSITORY(PTE)LIMITE",
        "MandateID": "",
        "totalItem": "1"
    },
    "ETAXPayment": {
        "UAT": {
            "loginCompanyId": "SPI303",
            "loginUserId": "SPI303V03",
            "verifyUserId": "SPI303V04",
            "fromAccount": "0017001765",
            "fileName1": "",
            "fileName2": "",
            "fileName3": ""
        },
        "SIT": {
            "loginCompanyId": "SPI303",
            "loginUserId": "SPI303V03",
            "verifyUserId": "SPI303V04",
            "fromAccount": "0017001765",
            "fileName1": "",
            "fileName2": "",
            "fileName3": ""
        },
        "TaxType1": "280",
        "TaxType2": "Karnataka State Tax - KPT",
        "TaxType3": "Maharashtra state tax - PTRC",
        "TaxType4": "Maharashtra state tax - PTEC",
        "TaxType5": "Customs duty",
        "TaxTypeGST":"GST",
        "TaxTypeCBDT":"CBDT",
        "TaxStateValue": "ANDAMAN ISLANDS",
        "CityValue": "Mumbai",
        "PinCodeValue": "400069",
        "PinCodeValueEdit": "999999",
        "PanNoValue": "ANWPR4550M",
        "PTRCTinNo": "27000001",
        "PTECTinNo": "99000001",
        "PTRCAccountValue": "12345678901234567890",
        "formIdValue": "5001006",
        "financialYearValue": "2024-25",
        "AssessmentYearValue": "2024-25",
        "TaxApplicableValue": "0020",
        "TypeOfPaymentValue": "100",
        "MonthsValue": "December",
        "DealerTypeValue": "Self-Employed Professional",
        "DealerTypeValue2": "Registered Employer",
        "ECNumberValue": "2023",
        "OfficeValue": "AutoTestOfficeAddress",
        "MobileNoValue": "18888155555",
        "PeriodValue": "Yearly",
        "YearValue": "2023-24",
        "Year": "2024",
        "PTRCRef": "PTRCRef",
        "taxPeriodValue": "Monthly",
        "periodValue": "January",
        "OrderNoValue": "12345678901234567890",
        "OrderDateValue": "12/12/2023",
        "DesignationValue": "AutoDesignationValue",
        "PTECAccountValue": "112233445566778899",
        "periodFromMonthValue": "October",
        "periodFromYearValue": "2024",
        "periodToMonthValue": "March",
        "periodToYearValue": "2025",
        "importExportCodeValue": "77889900",
        "importExportNameValue": "AutoTestImportExportName",
        "portCodeValue": "Alibag",
        "billOfEntryNumberValue": "6655443322",
        "billOfEntryDateValue": "01 Dec 2023",
        "challanNumberValue": "1234567890",
        "OptionalField1Value": "AutoTestOptionalFiled1",
        "OptionalField2Value": "AutoTestOptionalFiled2",
        "OptionalField3Value": "AutoTestOptionalFiled3",
        "OptionalField4Value": "AutoTestOptionalFiled4",
        "OptionalField5Value": "AutoTestOptionalFiled5",
        "TaxValue": "100",
        "amountOfTaxValue": "10",
        "amountOfTdsValue": "15",
        "SurchargeValue": "10",
        "EducationCessValue": "20",
        "InterestValue": "30",
        "compositionMoneyValue": "5",
        "fineValue": "8",
        "feesValue": "32",
        "advancePaymentValue": "11",
        "amountForfeitedValue": "35",
        "depositValue": "14",
        "PenaltyValue": "40",
        "OtherValue": "3000",
        "amountOfDutyPayableValue": "200",
        "amount": "200",
        "VerifyAmount": "3,170.00",
        "ViewPaymentType1": "India Tax Payment (Direct Tax - ITNS 280)",
        "ViewPaymentType2": "India Tax Payment (Karnataka State Tax - KPT)",
        "ViewPaymentType3": "India Tax Payment (Maharashtra state tax - PTRC)",
        "ViewPaymentType4": "India Tax Payment (Maharashtra state tax - PTEC)",
        "ViewPaymentType5": "India Tax Payment (Customs duty)",
        "ViewPaymentType6": "Direct Tax (Challan 281)",
        "ViewPaymentType7": "Direct Tax (Challan 282)",
        "ViewPaymentType8": "Direct Tax (Challan 283)",
        "RejectReason": "reasonForRejection",
        "newPayeeName": "Income Tax Department",
        "companyNameValue": "1002003"
    },
    "TTPayment": {
        "SIT": {
            "loginCompanyId": "SPI303",
            "loginUserId": "SPI303V011",
            "verifyUserId": "SPI303V09",
            "fromAccount": "0017001765"
        },
        "currency": "SGD",
        "country": "Singapore",
        "amount": "10",
        "editAmount": "20",
        "newPayeeName": "TTSNewPayeeName",
        "newPayeeAdd1": "newPayeeAdd1",
        "newPayeeAdd2": "newPayeeAdd2",
        "newPayeeAdd3": "newPayeeAdd3",
        "payeeBankID": "ABNASGF0XXX",
        "beneRoutingCode": "123456789",
        "newPayeeAcctNumber": "123456000001",
        "purposeCode": "S0501",
        "underlyingCode": "1.Imports",
        "underlyingCodeEdit": "3.Others",
        "locationofService": "ANDORRA",
        "CAAcknNumber": "11223344",
        "uploadFileName": "DIGI_DOC.pdf",
        "DocumentType": "Form A2 & Declaration under Fema",
        "paymentDetail": "PaymentDetails",
        "emailIdO": "Email0@dbs.com",
        "emailId1": "Email1@dbs.com",
        "emailId2": "Email2@dbs.com",
        "emailId3": "Email3@dbs.com",
        "emailId4": "Email4@dbs.com",
        "message": "message",
        "transactionNote": "transactionNote",
        "messageToOrderingBank": "messageToOrderingBank",
        "paymentType": "India Telegraphic Transfer",
        "payeeBankName": "ABN AMRO FUTURES (SINGAPORE) LIMITE",
        "payeeBankLocation": "SINGAPORE",
        "bankAdd1": "63 CHULIA STREET",
        "bankAdd2": "FLOOR 2",
        "bankCity": "SINGAPORE",
        "routingCodeValue": "123456789",
        "bankChargeUs": "You (DEBT/OUR)",
        "purposeCodeValue": "S0501 - Construction of projects abroad by Indian companies including import of goods at project site abroad"
    },
    "digidoc": {
        "SIT": {
            "loginCompanyId": "SPI303",
            "loginUserId": "SPI303AUTO2",
            "dateFrom": "01 Mar 2020",
            "dateTo": "11 Mar 2020",
            "fileName": ""
        },
        "fileType": "ALL",
        "fileFormat": "Universal File Format",
        "approvalOptionByTxn": "By Transaction",
        "uploadFileName": "DIGI_DOC.pdf",
        "DocumentType": "Other Supporting documents",
        "DocComment":"DocComment",
        "RejectComment":"document Agreements not uploaded"
    },
    "files": {
        "SIT": {
            "loginCompanyId": "INNIPL01",
            "loginUserId": "INNIPL01S01",
            "dateFrom": "01 Mar 2020",
            "dateTo": "11 Mar 2020",
            "fileName": "",
            "FromAccount": "827210062453",
            "Amount": "19.99"
        },
        "paymentType": "Payroll - NEFT",
        "approvalOption": "By transaction amount"
    },
    "OTT": {
        "SIT": {
            "loginCompanyId": "SPI303",
            "loginUserId": "SPI303AUTOUSER",
            "fromAccount": "123456789000",
            "existingPayee": "55667788"
        },
        "amountA1": "100",
        "Docamount": "10",
        "purposeCode": "S0017",
        "LocationOfService": "ANDORRA",
        "CAAcknowledgementnumber": "11223344",
        "DocumentType": "15CA",
        "DocpaymentDetail": "-PENDING-DOC-",
        "mChllengeText": "you are receiving the Challenge by SMS because you are trying to approve a transaction that you have created"
    },
    "ITT": {
        "SIT": {
            "loginCompanyId": "IN2BFE1",
            "loginUserId": "IN2BFE1S02",
            "ITTData": "forINDITIAUTOTEST2"
        },
        "dateFrom": "01 Mar 2019",
        "dateTo": "31 Mar 2019",
        "purposeCode": "E0002 - Export Bill Not Lodged",
        "fxContract": "FX ContractFX ContractFX ContractFX ContractFX Con",
        "disposalAccountInstruction": "Crediting Account or Pre Shipment Loan Number1234567890",
        "billRef": "Bill Reference"
    },
    "downloadFile": {
        "SIT": {
            "loginCompanyId": "IN2BFE1",
            "loginUserId": "IN2BFE1S02",
            "custRef": "EBLVT00701067130",
            "PaymentType": "Management Payroll - 02 - NEFT"
        },
        "fromDate": "01 Apr 2020"
    },
    "MT101Payment": {
        "SIT": {
            "loginCompanyId": "SPI303",
            "loginUserId": "SPI303V011"
        },
        "fromAccount": "0057001765",
        "paymentCurrency": "INR",
        "amount": "10",
        "fxContractReference": "testfxCR01234567",
        "existingPayee": "Jbene1111",
        "paymentTypeName": "MT101 Payment",
        "responseCode": "123456"
    },
    "PaymentReport": {
        "SIT": {
            "loginCompanyId": "SPI303",
            "loginUserId": "SPI303V01",
            "account": "999999999999 - 811210056911 - INR",
            "accountNotInclude": "0017001765Name - 0017001765 - INR"
        },
        "usage": "Shared",
        "daily": "Afternoon (12PM-2PM)",
        "deliverySchedule": "Daily",
        "deliveryOneOff": "One-off / ad-hoc",
        "password": "123456",
        "confirmPassword": "123456",
        "remarks": "remarks",
        "payeeReference": "payeeReference",
        "payeeName": "payeeName"
    }   
}